
read_verilog -sv exe_unit_w12.sv 
copy exe_unit_w12 exe_unit_w12_rtl
hierarchy -top exe_unit_w12_rtl
synth

abc -g AND,OR,XOR

opt_clean

write_verilog -noattr exe_unit_w12_rtl.sv

stat -tech cmos
