
read_verilog -sv change.sv 
copy change change_rtl
hierarchy -top change_rtl
synth

abc -g AND,OR,XOR

opt_clean

write_verilog -noattr change_rtl.sv

stat -tech cmos
