
read_verilog -sv setbit.sv 
copy setbit setbit_rtl
hierarchy -top setbit_rtl
synth

abc -g AND,OR,XOR

opt_clean

write_verilog -noattr setbit_rtl.sv

stat -tech cmos
