
read_verilog -sv dodawanie.sv 
copy dodawanie dodawanie_rtl
hierarchy -top dodawanie_rtl
synth

abc -g AND,OR,XOR

opt_clean

write_verilog -noattr dodawanie_rtl.sv

stat -tech cmos
